Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# ai.assistant.input.placeholder
source: Ask anything about this repo…
ar: اسأل أي شيء عن هذا المستودع…
de: Fragen Sie alles zu diesem Repository…
es: Pregunta cualquier cosa sobre este repositorio…
fr: Posez une question sur ce dépôt…
id: Tanyakan apa pun tentang repo ini…
it: Chiedi qualsiasi cosa su questo repository…
ja: このリポジトリについて質問…
ko: 이 저장소에 대해 무엇이든 물어보세요…
nl: Vraag alles over deze repo…
pl: Zapytaj o cokolwiek w tym repozytorium…
pt_br: Pergunte qualquer coisa sobre este repositório…
ru: Спросите что угодно об этом репозитории…
tr: Bu depo hakkında her şeyi sorun…
uk: Запитайте що завгодно про цей репозиторій…
vi: Hỏi bất cứ điều gì về repo này…
zh_hans: 问问关于这个仓库的问题…
zh_hant: 問問關於這個倉庫的問題…

# ai.assistant.input.send.help
source: Send (Return)
ar: إرسال (Return)
de: Senden (Eingabetaste)
es: Enviar (Retorno)
fr: Envoyer (Retour)
id: Kirim (Return)
it: Invia (Invio)
ja: 送信（Return）
ko: 보내기 (Return)
nl: Verzenden (Return)
pl: Wyślij (Return)
pt_br: Enviar (Return)
ru: Отправить (Return)
tr: Gönder (Return)
uk: Надіслати (Return)
vi: Gửi (Return)
zh_hans: 发送（Return）
zh_hant: 傳送（Return）

# ai.assistant.input.stop.help
source: Stop generating
ar: إيقاف التوليد
de: Generieren stoppen
es: Detener generación
fr: Arrêter la génération
id: Hentikan pembuatan
it: Interrompi generazione
ja: 生成を停止
ko: 생성 중지
nl: Stoppen met genereren
pl: Zatrzymaj generowanie
pt_br: Parar geração
ru: Остановить генерацию
tr: Oluşturmayı durdur
uk: Зупинити генерацію
vi: Dừng tạo
zh_hans: 停止生成
zh_hant: 停止生成

# ai.assistant.openButton.help
source: Open AI Assistant (summary + chat) (%@)
ar: فتح المساعد الذكي (ملخص + محادثة) (%@)
de: KI-Assistent öffnen (Zusammenfassung + Chat) (%@)
es: Abrir Asistente de IA (resumen + chat) (%@)
fr: Ouvrir l'assistant IA (résumé + chat) (%@)
id: Buka Asisten AI (ringkasan + obrolan) (%@)
it: Apri Assistente AI (riepilogo + chat) (%@)
ja: AIアシスタントを開く（サマリー＋チャット）（%@）
ko: AI 어시스턴트 열기 (요약 + 채팅) (%@)
nl: AI-assistent openen (samenvatting + chat) (%@)
pl: Otwórz Asystenta AI (podsumowanie + czat) (%@)
pt_br: Abrir Assistente de IA (resumo + chat) (%@)
ru: Открыть AI-ассистент (сводка + чат) (%@)
tr: AI Asistanı Aç (özet + sohbet) (%@)
uk: Відкрити AI-асистент (підсумок + чат) (%@)
vi: Mở Trợ lý AI (tóm tắt + trò chuyện) (%@)
zh_hans: 打开 AI 助手(摘要 + 对话) (%@)
zh_hant: 開啟 AI 助手（摘要 + 對話）（%@）

# ai.assistant.openButton.help.shortcutDisabled
source: Open AI Assistant (summary + chat); keyboard shortcut disabled
ar: فتح المساعد الذكي (ملخص + محادثة)؛ اختصار لوحة المفاتيح معطل
de: KI-Assistent öffnen (Zusammenfassung + Chat); Tastaturkurzbefehl deaktiviert
es: Abrir Asistente de IA (resumen + chat); atajo de teclado desactivado
fr: Ouvrir l'assistant IA (résumé + chat) ; raccourci clavier désactivé
id: Buka Asisten AI (ringkasan + obrolan); pintasan keyboard dinonaktifkan
it: Apri Assistente AI (riepilogo + chat); scorciatoia da tastiera disabilitata
ja: AIアシスタントを開く（サマリー＋チャット）; キーボードショートカットは無効
ko: AI 어시스턴트 열기 (요약 + 채팅); 키보드 단축키 비활성화됨
nl: AI-assistent openen (samenvatting + chat); sneltoets uitgeschakeld
pl: Otwórz Asystenta AI (podsumowanie + czat); skrót klawiszowy wyłączony
pt_br: Abrir Assistente de IA (resumo + chat); atalho de teclado desativado
ru: Открыть AI-ассистент (сводка + чат); сочетание клавиш отключено
tr: AI Asistanı Aç (özet + sohbet); klavye kısayolu devre dışı
uk: Відкрити AI-асистент (підсумок + чат); сполучення клавіш вимкнено
vi: Mở Trợ lý AI (tóm tắt + trò chuyện); phím tắt bị tắt
zh_hans: 打开 AI 助手（摘要 + 对话）；键盘快捷键已停用
zh_hant: 開啟 AI 助手（摘要 + 對話）；鍵盤快捷鍵已停用

# ai.assistant.prep.accessibility.active
source: in progress
ar: قيد التقدم
de: in Bearbeitung
es: en progreso
fr: en cours
id: sedang berlangsung
it: in corso
ja: 進行中
ko: 진행 중
nl: bezig
pl: w trakcie
pt_br: em andamento
ru: выполняется
tr: devam ediyor
uk: виконується
vi: đang tiến hành
zh_hans: 进行中
zh_hant: 進行中

# ai.assistant.prep.accessibility.done
source: completed
ar: مكتمل
de: abgeschlossen
es: completado
fr: terminé
id: selesai
it: completato
ja: 完了
ko: 완료
nl: voltooid
pl: ukończono
pt_br: concluído
ru: завершено
tr: tamamlandı
uk: завершено
vi: đã hoàn thành
zh_hans: 已完成
zh_hant: 已完成

# ai.assistant.prep.accessibility.failed
source: failed
ar: فشل
de: fehlgeschlagen
es: fallido
fr: échoué
id: gagal
it: non riuscito
ja: 失敗
ko: 실패
nl: mislukt
pl: niepowodzenie
pt_br: falhou
ru: не удалось
tr: başarısız
uk: помилка
vi: thất bại
zh_hans: 失败
zh_hant: 失敗

# ai.assistant.prep.accessibility.pending
source: pending
ar: معلق
de: ausstehend
es: pendiente
fr: en attente
id: menunggu
it: in attesa
ja: 保留中
ko: 대기 중
nl: in wachtrij
pl: oczekujące
pt_br: pendente
ru: ожидание
tr: beklemede
uk: очікує
vi: đang chờ
zh_hans: 等待中
zh_hant: 等待中

# ai.assistant.prep.accessibility.running
source: Preparing context
ar: تحضير السياق
de: Kontext wird vorbereitet
es: Preparando contexto
fr: Préparation du contexte
id: Menyiapkan konteks
it: Preparazione contesto
ja: コンテキストを準備中
ko: 컨텍스트 준비 중
nl: Context voorbereiden
pl: Przygotowywanie kontekstu
pt_br: Preparando contexto
ru: Подготовка контекста
tr: Bağlam hazırlanıyor
uk: Підготовка контексту
vi: Đang chuẩn bị ngữ cảnh
zh_hans: 正在准备上下文
zh_hant: 正在準備上下文

# ai.assistant.prep.skipCurrent
source: Skip
ar: تخطي
de: Überspringen
es: Saltar
fr: Ignorer
id: Lewati
it: Salta
ja: スキップ
ko: 건너뛰기
nl: Overslaan
pl: Pomiń
pt_br: Pular
ru: Пропустить
tr: Atla
uk: Пропустити
vi: Bỏ qua
zh_hans: 跳过
zh_hant: 跳過

# ai.assistant.prep.skipCurrent.accessibility
source: Skip code context and continue generating
ar: تخطي سياق الكود ومتابعة التوليد
de: Code-Kontext überspringen und Generierung fortsetzen
es: Saltar contexto de código y continuar generando
fr: Ignorer le contexte du code et continuer la génération
id: Lewati konteks kode dan lanjutkan pembuatan
it: Salta il contesto del codice e continua la generazione
ja: コードコンテキストをスキップして生成を続行
ko: 코드 컨텍스트를 건너뛰고 계속 생성
nl: Codecontext overslaan en doorgaan met genereren
pl: Pomiń kontekst kodu i kontynuuj generowanie
pt_br: Pular contexto do código e continuar gerando
ru: Пропустить контекст кода и продолжить генерацию
tr: Kod bağlamını atla ve oluşturmaya devam et
uk: Пропустити контекст коду та продовжити генерацію
vi: Bỏ qua ngữ cảnh mã và tiếp tục tạo
zh_hans: 跳过代码上下文并继续生成
zh_hant: 跳過程式碼上下文並繼續生成

# ai.assistant.prep.step.downloadingArchive
source: Downloading archive
ar: تنزيل الأرشيف
de: Archiv wird heruntergeladen
es: Descargando archivo
fr: Téléchargement de l'archive
id: Mengunduh arsip
it: Download archivio
ja: アーカイブをダウンロード中
ko: 아카이브 다운로드 중
nl: Archief downloaden
pl: Pobieranie archiwum
pt_br: Baixando arquivo
ru: Загрузка архива
tr: Arşiv indiriliyor
uk: Завантаження архіву
vi: Đang tải xuống kho lưu trữ
zh_hans: 下载项目代码
zh_hant: 下載專案程式碼

# ai.assistant.prep.step.externalSearch
source: External Search
ar: بحث خارجي
de: Externe Suche
es: Búsqueda externa
fr: Recherche externe
id: Pencarian Eksternal
it: Ricerca esterna
ja: 外部検索
ko: 외부 검색
nl: Externe zoekopdracht
pl: Wyszukiwanie zewnętrzne
pt_br: Pesquisa Externa
ru: Внешний поиск
tr: Harici Arama
uk: Зовнішній пошук
vi: Tìm kiếm bên ngoài
zh_hans: 获取外部资料
zh_hant: 取得外部資料

# ai.assistant.prep.step.packingContext
source: Packing context
ar: تعبئة السياق
de: Kontext wird verpackt
es: Empaquetando contexto
fr: Compression du contexte
id: Mengemas konteks
it: Impacchettamento contesto
ja: コンテキストをパッキング中
ko: 컨텍스트 패킹 중
nl: Context inpakken
pl: Pakowanie kontekstu
pt_br: Empacotando contexto
ru: Упаковка контекста
tr: Bağlam paketleniyor
uk: Пакування контексту
vi: Đang đóng gói ngữ cảnh
zh_hans: 解压并生成上下文
zh_hant: 解壓並生成上下文

# ai.assistant.prep.step.requestingLLM
source: Requesting AI
ar: طلب الذكاء الاصطناعي
de: KI wird angefragt
es: Solicitando IA
fr: Requête à l'IA
id: Meminta AI
it: Richiesta AI
ja: AIにリクエスト中
ko: AI 요청 중
nl: AI aanvragen
pl: Wysyłanie zapytania do AI
pt_br: Solicitando IA
ru: Запрос к AI
tr: AI isteği yapılıyor
uk: Запит до AI
vi: Đang yêu cầu AI
zh_hans: 准备摘要请求
zh_hant: 準備摘要請求

# ai.assistant.prep.step.resolvingBranch
source: Resolving branch
ar: حل الفرع
de: Branch wird aufgelöst
es: Resolviendo rama
fr: Résolution de la branche
id: Menyelesaikan cabang
it: Risoluzione branch
ja: ブランチを解決中
ko: 브랜치 확인 중
nl: Branch oplossen
pl: Rozpoznawanie gałęzi
pt_br: Resolvendo branch
ru: Определение ветки
tr: Dal çözümleniyor
uk: Визначення гілки
vi: Đang phân giải nhánh
zh_hans: 解析分支
zh_hant: 解析分支

# ai.assistant.prep.stop.accessibility
source: Stop preparing code context
ar: إيقاف تحضير سياق الكود
de: Vorbereitung des Code-Kontexts beenden
es: Detener preparación del contexto de código
fr: Arrêter la préparation du contexte du code
id: Hentikan persiapan konteks kode
it: Interrompi preparazione contesto codice
ja: コードコンテキストの準備を停止
ko: 코드 컨텍스트 준비 중단
nl: Codecontext voorbereiden stoppen
pl: Zatrzymaj przygotowywanie kontekstu kodu
pt_br: Parar preparação do contexto do código
ru: Остановить подготовку контекста кода
tr: Kod bağlamı hazırlamayı durdur
uk: Зупинити підготовку контексту коду
vi: Dừng chuẩn bị ngữ cảnh mã
zh_hans: 停止准备代码上下文
zh_hant: 停止準備程式碼上下文

# ai.assistant.summary.codeContext.disabled
source: Project Context is off
ar: سياق المشروع متوقف
de: Projektkontext ist aus
es: Contexto del proyecto desactivado
fr: Contexte du projet désactivé
id: Konteks Proyek mati
it: Contesto progetto disattivato
ja: プロジェクトコンテキストがオフ
ko: 프로젝트 컨텍스트 꺼짐
nl: Projectcontext is uit
pl: Kontekst projektu jest wyłączony
pt_br: Contexto do Projeto desativado
ru: Контекст проекта выключен
tr: Proje Bağlamı kapalı
uk: Контекст проєкту вимкнено
vi: Ngữ cảnh dự án đã tắt
zh_hans: 项目上下文未开启
zh_hant: 專案上下文未開啟

# ai.assistant.summary.codeContext.enabled
source: Project Context is on
ar: سياق المشروع قيد التشغيل
de: Projektkontext ist ein
es: Contexto del proyecto activado
fr: Contexte du projet activé
id: Konteks Proyek hidup
it: Contesto progetto attivo
ja: プロジェクトコンテキストがオン
ko: 프로젝트 컨텍스트 켜짐
nl: Projectcontext is aan
pl: Kontekst projektu jest włączony
pt_br: Contexto do Projeto ativado
ru: Контекст проекта включён
tr: Proje Bağlamı açık
uk: Контекст проєкту увімкнено
vi: Ngữ cảnh dự án đã bật
zh_hans: 项目上下文已开启
zh_hant: 專案上下文已開啟

# ai.assistant.summary.codeContext.openSettings
source: Open Settings
ar: فتح الإعدادات
de: Einstellungen öffnen
es: Abrir ajustes
fr: Ouvrir les réglages
id: Buka Pengaturan
it: Apri Impostazioni
ja: 設定を開く
ko: 설정 열기
nl: Instellingen openen
pl: Otwórz ustawienia
pt_br: Abrir Configurações
ru: Открыть настройки
tr: Ayarları Aç
uk: Відкрити налаштування
vi: Mở Cài đặt
zh_hans: 前往设置
zh_hant: 前往設定

# ai.assistant.summary.contextSkipped
source: Code context skipped. Generating summary…
ar: تم تخطي سياق الكود. جارٍ إنشاء الملخص…
de: Code-Kontext übersprungen. Zusammenfassung wird erstellt…
es: Contexto de código omitido. Generando resumen…
fr: Contexte du code ignoré. Génération du résumé…
id: Konteks kode dilewati. Menghasilkan ringkasan…
it: Contesto codice saltato. Generazione riepilogo…
ja: コードコンテキストをスキップしました。サマリーを生成中…
ko: 코드 컨텍스트 건너뜀. 요약 생성 중…
nl: Codecontext overgeslagen. Samenvatting wordt gegenereerd…
pl: Pominięto kontekst kodu. Generowanie podsumowania…
pt_br: Contexto do código ignorado. Gerando resumo…
ru: Контекст кода пропущен. Генерация сводки…
tr: Kod bağlamı atlandı. Özet oluşturuluyor…
uk: Контекст коду пропущено. Генерація підсумку…
vi: Đã bỏ qua ngữ cảnh mã. Đang tạo tóm tắt…
zh_hans: 已跳过代码上下文，正在生成摘要…
zh_hant: 已跳過程式碼上下文，正在生成摘要…

# ai.assistant.summary.copy.tooltip
source: Copy summary to clipboard
ar: نسخ الملخص إلى الحافظة
de: Zusammenfassung in Zwischenablage kopieren
es: Copiar resumen al portapapeles
fr: Copier le résumé dans le presse-papiers
id: Salin ringkasan ke papan klip
it: Copia riepilogo negli appunti
ja: サマリーをクリップボードにコピー
ko: 요약을 클립보드에 복사
nl: Samenvatting naar klembord kopiëren
pl: Kopiuj podsumowanie do schowka
pt_br: Copiar resumo para a área de transferência
ru: Копировать сводку в буфер обмена
tr: Özeti panoya kopyala
uk: Копіювати підсумок у буфер обміну
vi: Sao chép tóm tắt vào bảng tạm
zh_hans: 复制摘要到剪贴板
zh_hant: 複製摘要到剪貼簿

# ai.assistant.summary.empty.description
source: When enabled, Project Context analyzes the repository's code structure during summary generation to improve accuracy. Code is prepared only after you click Generate Summary.
ar: عند التمكين، يحلل سياق المشروع بنية كود المستودع أثناء إنشاء الملخص لتحسين الدقة. يتم تحضير الكود فقط بعد النقر على إنشاء الملخص.
de: Wenn aktiviert, analysiert der Projektkontext während der Zusammenfassung die Codestruktur des Repositorys, um die Genauigkeit zu verbessern. Code wird erst nach Klicken auf „Zusammenfassung generieren“ vorbereitet.
es: Cuando está activado, el Contexto del proyecto analiza la estructura del código del repositorio durante la generación del resumen para mejorar la precisión. El código se prepara solo después de hacer clic en Generar resumen.
fr: Lorsqu'il est activé, le contexte du projet analyse la structure du code du dépôt pendant la génération du résumé pour améliorer la précision. Le code est préparé uniquement après avoir cliqué sur Générer le résumé.
id: Saat diaktifkan, Konteks Proyek menganalisis struktur kode repositori selama pembuatan ringkasan untuk meningkatkan akurasi. Kode disiapkan hanya setelah Anda mengklik Hasilkan Ringkasan.
it: Se attivato, il Contesto Progetto analizza la struttura del codice del repository durante la generazione del riepilogo per migliorare la precisione. Il codice viene preparato solo dopo aver cliccato Genera Riepilogo.
ja: 有効にすると、プロジェクトコンテキストはサマリー生成時にリポジトリのコード構造を分析し、精度を向上させます。コードは「サマリーを生成」をクリックした後にのみ準備されます。
ko: 활성화하면 프로젝트 컨텍스트가 요약 생성 중에 저장소의 코드 구조를 분석하여 정확도를 높입니다. 코드는 '요약 생성'을 클릭한 후에만 준비됩니다.
nl: Indien ingeschakeld analyseert Projectcontext de codestructuur van de repository tijdens het genereren van de samenvatting voor een hogere nauwkeurigheid. Code wordt pas voorbereid nadat u op 'Samenvatting genereren' klikt.
pl: Po włączeniu, Kontekst projektu analizuje strukturę kodu repozytorium podczas generowania podsumowania, aby zwiększyć dokładność. Kod jest przygotowywany dopiero po kliknięciu Generuj podsumowanie.
pt_br: Quando ativado, o Contexto do Projeto analisa a estrutura do código do repositório durante a geração do resumo para melhorar a precisão. O código é preparado somente após clicar em Gerar Resumo.
ru: При включении контекст проекта анализирует структуру кода репозитория во время генерации сводки для повышения точности. Код подготавливается только после нажатия «Сгенерировать сводку».
tr: Etkinleştirildiğinde, Proje Bağlamı özet oluşturma sırasında deponun kod yapısını analiz ederek doğruluğu artırır. Kod yalnızca Özet Oluştur'a tıkladıktan sonra hazırlanır.
uk: Якщо увімкнено, контекст проєкту аналізує структуру коду репозиторію під час генерації підсумку для підвищення точності. Код готується лише після натискання «Згенерувати підсумок».
vi: Khi được bật, Ngữ cảnh dự án sẽ phân tích cấu trúc mã của kho lưu trữ trong quá trình tạo tóm tắt để cải thiện độ chính xác. Mã chỉ được chuẩn bị sau khi bạn nhấp vào Tạo Tóm tắt.
zh_hans: 开启项目上下文后，生成摘要时会分析仓库代码结构，帮助 AI 更准确地理解项目；相关代码仅在点击「生成摘要」后准备。
zh_hant: 開啟專案上下文後，生成摘要時會分析倉庫程式碼結構，幫助 AI 更準確地理解專案；相關程式碼僅在點擊「生成摘要」後準備。

# ai.assistant.summary.empty.title
source: No AI summary yet
ar: لا يوجد ملخص ذكي بعد
de: Noch keine KI-Zusammenfassung
es: Aún no hay resumen de IA
fr: Pas encore de résumé IA
id: Belum ada ringkasan AI
it: Nessun riepilogo AI ancora
ja: AIサマリーはまだありません
ko: 아직 AI 요약 없음
nl: Nog geen AI-samenvatting
pl: Brak podsumowania AI
pt_br: Nenhum resumo de IA ainda
ru: Сводка AI ещё не создана
tr: Henüz AI özeti yok
uk: Ще немає AI-підсумку
vi: Chưa có tóm tắt AI
zh_hans: 尚未生成 AI 摘要
zh_hant: 尚未生成 AI 摘要

# ai.assistant.summary.error.requestFailed
source: The AI request failed. Check the API key, Base URL, model name, and your network connection.
ar: فشل طلب الذكاء الاصطناعي. تحقق من مفتاح API وعنوان URL الأساسي واسم النموذج واتصال الشبكة.
de: Die KI-Anfrage ist fehlgeschlagen. Überprüfen Sie den API-Schlüssel, die Basis-URL, den Modellnamen und Ihre Netzwerkverbindung.
es: La solicitud a la IA falló. Verifica la clave API, la URL base, el nombre del modelo y tu conexión de red.
fr: La requête IA a échoué. Vérifiez la clé API, l'URL de base, le nom du modèle et votre connexion réseau.
id: Permintaan AI gagal. Periksa kunci API, URL Dasar, nama model, dan koneksi jaringan Anda.
it: La richiesta AI non è riuscita. Controlla la chiave API, l'URL di base, il nome del modello e la connessione di rete.
ja: AIリクエストが失敗しました。APIキー、ベースURL、モデル名、ネットワーク接続を確認してください。
ko: AI 요청이 실패했습니다. API 키, 기본 URL, 모델 이름 및 네트워크 연결을 확인하세요.
nl: Het AI-verzoek is mislukt. Controleer de API-sleutel, basis-URL, modelnaam en uw netwerkverbinding.
pl: Żądanie AI nie powiodło się. Sprawdź klucz API, podstawowy URL, nazwę modelu i połączenie sieciowe.
pt_br: A solicitação de IA falhou. Verifique a chave da API, URL Base, nome do modelo e sua conexão de rede.
ru: Запрос к AI не удался. Проверьте API-ключ, базовый URL, имя модели и сетевое подключение.
tr: AI isteği başarısız oldu. API anahtarını, Temel URL'yi, model adını ve ağ bağlantınızı kontrol edin.
uk: Запит до AI не вдався. Перевірте API-ключ, базову URL-адресу, назву моделі та мережеве з'єднання.
vi: Yêu cầu AI thất bại. Kiểm tra khóa API, URL gốc, tên mô hình và kết nối mạng của bạn.
zh_hans: 调用 AI 服务失败。请检查 API Key、Base URL、模型名称是否正确，以及网络是否可用。
zh_hant: 呼叫 AI 服務失敗。請檢查 API Key、Base URL、模型名稱是否正確，以及網路是否可用。

# ai.assistant.summary.error.requestFailedFormat
source: The AI request failed: %@. Check the API key, Base URL, model name, and your network connection.
ar: فشل طلب الذكاء الاصطناعي: %@. تحقق من مفتاح API وعنوان URL الأساسي واسم النموذج واتصال الشبكة.
de: Die KI-Anfrage ist fehlgeschlagen: %@. Überprüfen Sie den API-Schlüssel, die Basis-URL, den Modellnamen und Ihre Netzwerkverbindung.
es: La solicitud a la IA falló: %@. Verifica la clave API, la URL base, el nombre del modelo y tu conexión de red.
fr: La requête IA a échoué : %@. Vérifiez la clé API, l'URL de base, le nom du modèle et votre connexion réseau.
id: Permintaan AI gagal: %@. Periksa kunci API, URL Dasar, nama model, dan koneksi jaringan Anda.
it: La richiesta AI non è riuscita: %@. Controlla la chiave API, l'URL di base, il nome del modello e la connessione di rete.
ja: AIリクエストが失敗しました: %@。APIキー、ベースURL、モデル名、ネットワーク接続を確認してください。
ko: AI 요청이 실패했습니다: %@. API 키, 기본 URL, 모델 이름 및 네트워크 연결을 확인하세요.
nl: Het AI-verzoek is mislukt: %@. Controleer de API-sleutel, basis-URL, modelnaam en uw netwerkverbinding.
pl: Żądanie AI nie powiodło się: %@. Sprawdź klucz API, podstawowy URL, nazwę modelu i połączenie sieciowe.
pt_br: A solicitação de IA falhou: %@. Verifique a chave da API, URL Base, nome do modelo e sua conexão de rede.
ru: Запрос к AI не удался: %@. Проверьте API-ключ, базовый URL, имя модели и сетевое подключение.
tr: AI isteği başarısız oldu: %@. API anahtarını, Temel URL'yi, model adını ve ağ bağlantınızı kontrol edin.
uk: Запит до AI не вдався: %@. Перевірте API-ключ, базову URL-адресу, назву моделі та мережеве з'єднання.
vi: Yêu cầu AI thất bại: %@. Kiểm tra khóa API, URL gốc, tên mô hình và kết nối mạng của bạn.
zh_hans: 调用 AI 服务失败：%@。请检查 API Key、Base URL、模型名称是否正确，以及网络是否可用。
zh_hant: 呼叫 AI 服務失敗：%@。請檢查 API Key、Base URL、模型名稱是否正確，以及網路是否可用。

# ai.assistant.summary.externalReferences.title
source: External References
ar: مراجع خارجية
de: Externe Referenzen
es: Referencias externas
fr: Références externes
id: Referensi Eksternal
it: Riferimenti esterni
ja: 外部参照
ko: 외부 참조
nl: Externe verwijzingen
pl: Odnośniki zewnętrzne
pt_br: Referências Externas
ru: Внешние ссылки
tr: Harici Referanslar
uk: Зовнішні посилання
vi: Tham khảo bên ngoài
zh_hans: 外部参考来源
zh_hant: 外部參考來源

# ai.assistant.summary.fetchingExternal
source: Fetching external materials…
ar: جارٍ جلب المواد الخارجية…
de: Externe Materialien werden abgerufen…
es: Obteniendo materiales externos…
fr: Récupération des documents externes…
id: Mengambil materi eksternal…
it: Recupero materiali esterni…
ja: 外部資料を取得中…
ko: 외부 자료 가져오는 중…
nl: Extern materiaal ophalen…
pl: Pobieranie materiałów zewnętrznych…
pt_br: Buscando materiais externos…
ru: Загрузка внешних материалов…
tr: Harici materyaller getiriliyor…
uk: Отримання зовнішніх матеріалів…
vi: Đang tìm nạp tài liệu bên ngoài…
zh_hans: 正在获取外部资料…
zh_hant: 正在取得外部資料…

# ai.assistant.summary.fetchingExternal.caption
source: Using External Search to find documentation, release notes, and related pages
ar: استخدام البحث الخارجي للعثور على الوثائق وملاحظات الإصدار والصفحات ذات الصلة
de: Externe Suche wird verwendet, um Dokumentation, Versionshinweise und verwandte Seiten zu finden
es: Usando búsqueda externa para encontrar documentación, notas de versión y páginas relacionadas
fr: Utilisation de la recherche externe pour trouver documentation, notes de version et pages associées
id: Menggunakan Pencarian Eksternal untuk menemukan dokumentasi, catatan rilis, dan halaman terkait
it: Utilizzo della Ricerca esterna per trovare documentazione, note di rilascio e pagine correlate
ja: 外部検索を使用してドキュメント、リリースノート、関連ページを検索中
ko: 외부 검색을 사용하여 문서, 릴리스 노트 및 관련 페이지를 찾는 중
nl: Externe zoekopdracht gebruiken om documentatie, release-opmerkingen en gerelateerde pagina's te vinden
pl: Używanie wyszukiwania zewnętrznego do znalezienia dokumentacji, informacji o wydaniach i powiązanych stron
pt_br: Usando Pesquisa Externa para encontrar documentação, notas de versão e páginas relacionadas
ru: Используется внешний поиск для нахождения документации, примечаний к выпуску и связанных страниц
tr: Dokümantasyon, sürüm notları ve ilgili sayfaları bulmak için Harici Arama kullanılıyor
uk: Використання зовнішнього пошуку для знаходження документації, приміток до релізу та пов'язаних сторінок
vi: Sử dụng Tìm kiếm bên ngoài để tìm tài liệu, ghi chú phát hành và các trang liên quan
zh_hans: 正在通过 External Search 检索文档、Release Notes 等相关网页
zh_hant: 正在透過 External Search 檢索文件、Release Notes 等相關網頁

# ai.assistant.summary.footer.contextMeta.commit.help
source: View this commit on GitHub
ar: عرض هذا الالتزام على GitHub
de: Diesen Commit auf GitHub anzeigen
es: Ver este commit en GitHub
fr: Voir ce commit sur GitHub
id: Lihat komit ini di GitHub
it: Visualizza questo commit su GitHub
ja: このコミットをGitHubで表示
ko: GitHub에서 이 커밋 보기
nl: Deze commit op GitHub bekijken
pl: Zobacz ten commit na GitHub
pt_br: Ver este commit no GitHub
ru: Просмотреть этот коммит на GitHub
tr: Bu commit'i GitHub'da görüntüle
uk: Переглянути цей коміт на GitHub
vi: Xem commit này trên GitHub
zh_hans: 在 GitHub 上查看此 commit
zh_hant: 在 GitHub 上檢視此 commit

# ai.assistant.summary.footer.contextMeta.prefix
source: Based on
ar: بناءً على
de: Basiert auf
es: Basado en
fr: Basé sur
id: Berdasarkan
it: Basato su
ja: 基づく
ko: 기반
nl: Gebaseerd op
pl: Na podstawie
pt_br: Baseado em
ru: На основе
tr: Şuraya dayanır
uk: На основі
vi: Dựa trên
zh_hans: 基于
zh_hant: 基於

# ai.assistant.summary.footer.contextMeta.statsFormat
source: (%1$d tokens · %2$d files)
ar: (%1$d رمز مميز · %2$d ملفات)
de: (%1$d Token · %2$d Dateien)
es: (%1$d tokens · %2$d archivos)
fr: (%1$d jetons · %2$d fichiers)
id: (%1$d token · %2$d berkas)
it: (%1$d token · %2$d file)
ja: （%1$d トークン · %2$d ファイル）
ko: (%1$d 토큰 · %2$d 파일)
nl: (%1$d tokens · %2$d bestanden)
pl: (%1$d tokenów · %2$d plików)
pt_br: (%1$d tokens · %2$d arquivos)
ru: (%1$d токенов · %2$d файлов)
tr: (%1$d token · %2$d dosya)
uk: (%1$d токенів · %2$d файлів)
vi: (%1$d token · %2$d tệp)
